# Introducción

El presente documento desarrollara un trabajo de análisis  sobre el diseño e implementación de las siguientes bases de datos: 
•	Employee data
•	World database 
•	World_x database 
•	Sakila database 
•	Menagerie database 

Este grupo de bases de datos hace parte de los ejemplos de bases de datos de la documentación de MySQL [[1]](https://dev.mysql.com/doc/index-other.html).

Para el caso de la base de datos Employee data, es una base de datos creada por Patrick Crews y Giuseppe Maxia que está compuesta principalmente por seis tablas  que en total tiene aproximadamente 4 millones de registros (160 MB aproximadamente) [[2]](https://dev.mysql.com/doc/employee/en/). 

La base de datos World es una base de datos pequeña de ejemplo, esta cuenta con 3 tablas y en total tiene 5302 registros [[3]](https://dev.mysql.com/doc/world-setup/en/).

La base de datos World X es la misma base de datos World excepto por algunas características adicionales que permiten una compatibilidad con X DevAPI. X DevAPI es una alternativa para acceder a MySQL de una forma parecida a una API-CRUD [[4]](https://dev.mysql.com/doc/world-x-setup/en/).

La base de datos Sakila fue creada por Mike Hillyer, que intenta proveer una base de datos con un esquema estándar además que contiene varias características adicionales de MySQL como vistas, procedimientos almacenados y disparadores. Está compuesta de 23 tablas y contiene aproximadamente 50000 registros [[5]](https://dev.mysql.com/doc/sakila/en/).

La base de datos Menagerie consiste en una base de datos muy simple que trata de modelar una situación de la vida real, donde contiene 2 tablas y 19 registros en total [[6]](https://dev.mysql.com/doc/refman/8.0/en/database-use.html).

# Instalación

Dado que las bases de datos usadas para este trabajo hacen parte de la documentación oficial de MySQL, su descarga es sencilla mediante su [página web]( https://dev.mysql.com/doc/index-other.html). Para este procedimiento se usará el sistema operativo [Centos 7]( http://isoredirect.centos.org/centos/7/isos/x86_64/)  y el motor de base de datos [Mariadb  Version 15.1 Distribución 10.5.9]( https://espejito.fder.edu.uy/mariadb//mariadb-10.5.9/yum/rhel/7/x86_64). Para cada base de datos el procedimiento consiste en los siguientes pasos:
1.	Descargar la base de datos.
2.	Descomprimir los archivos.
3.	Importar/Ejecutar los scripts para la creación de la base de datos.

Los pasos anteriores se pueden ejecutar en un par de comandos en una sola línea mediante consola de comandos en Linux: 

1.	Base de datos Employee:

```bash 
git clone git@github.com:datacharmer/test_db.git ; \
cd test_db ; \
mysql -u drojas –pmy_password  -e 'CREATE DATABASE employees;' ; \
mysql --user='drojas' –pmy_password  employees < employees.sql
``` 

2.	Base de datos World:

```bash
wget https://downloads.mysql.com/docs/world.sql.gz ; \
gzip -d world.sql.gz ; \
mysql -u drojas -pmy_password  -e 'CREATE DATABASE world;' ; \
mysql -u drojas –pmy_password  world < world.sql
```

3.	Base de datos World-X:

```bash
wget https://downloads.mysql.com/docs/world_x-db.tar.gz ; \
tar zxvf world_x-db.tar.gz ; \
cd world_x-db ; \
mysql -u drojas - pmy_password  -e 'CREATE DATABASE world_x;' ; \
cp world_x.sql /tmp/ ; \ 
mysql -u drojas - pmy_password  -e 'SOURCE /tmp/world_x.sql;'; 
```


4.	Base de datos Sakila:

```bash
wget https://downloads.mysql.com/docs/sakila-db.tar.gz ; \
tar xzvf sakila-db.tar.gz ; \
cd sakila-db ; \
mysql -u drojas - pmy_password -e 'DROP DATABASE sakila; CREATE DATABASE sakila;' ;\
mysql -u drojas - pmy_password sakila < sakila-schema.sql ; \
mysql -u drojas - pmy_password sakila < sakila-data.sql 
```

5.	Base de datos Menagerie:

```bash
wget https://downloads.mysql.com/docs/menagerie-db.tar.gz; \
tar xzvf menagerie-db.tar.gz ; \
cd menagerie-db ; \
mysql -u drojas -pmy_password  -e 'CREATE DATABASE menagerie;' ; \
mysql -u drojas -pmy_password menagerie < cr_pet_tbl.sql ; \
mysql -u drojas -pmy_password menagerie < ins_puff_rec.sql ; \
mysql -u drojas -pmy_password  menagerie < cr_event_tbl.sql ; \
mysqlimport -u drojas -pmy_password  --local menagerie event.txt ; \
mysqlimport -u drojas -pmy_password  --local menagerie pet.txt 
```

# Diagramas Entidad-Relación

A continuación se presentan los diagramas Entidad-Relación de las bases de datos. Estos diagramas se generaron mediante [DBeaver](https://dbeaver.com/docs/wiki/ER-Diagrams/).

1.	Base de datos Employee:

![diagrama_e_r_employee](er/employees.png)

2.	Base de datos World:

![diagrama_e_r_world](er/world.png)

3.	Base de datos World-X:

![diagrama_e_r_world_x](er/world_x.png)

4.	Base de datos Sakila:

![diagrama_e_r_sakila](er/sakila.png)

5.	Base de datos Menagerie:

![diagrama_e_r_menagerie](er/menagerie.png)

# Procedimiento almacenado

MySQL en el caso de MariaDB soportan la funcionalidad de Procedimientos almacenados. Un procedimiento almacenado puede definirse como una porción de código que se puede guardar y reutilizar de una manera fácil, dicho de otra manera, permite agrupar código y guardarlo para  reutilizarlo sin tener que volver a escribir todo ese código. Al igual que una función, un procedimiento almacenado puede parametrizarse, la sintaxis para crear un procedimiento almacenado es:

```sql
CREATE PROCEDURE nombre_procedimiento()
BEGIN
    código_sql
END;
```

Un ejemplo aplicado a la base de datos Sakila sería:

In [29]:
DELIMITER $$
CREATE PROCEDURE get_films()
BEGIN
    SELECT f.title, f.release_year, l.name as `language`, f.special_features, c.name as category
    FROM sakila.film f 
    JOIN sakila.film_category fc using(film_id)
    JOIN sakila.category c  using(category_id)
    JOIN sakila.`language` l using(language_id) 
    LIMIT 10;
END;

<br>
Para utilizar o hace un llamado a este procedimiento almacendo, ejecutar:

In [30]:
call get_films();

title,release_year,language,special_features,category
AMADEUS HOLY,2006,English,"Commentaries,Deleted Scenes,Behind the Scenes",Action
AMERICAN CIRCUS,2006,English,"Commentaries,Behind the Scenes",Action
ANTITRUST TOMATOES,2006,English,"Trailers,Commentaries,Deleted Scenes",Action
ARK RIDGEMONT,2006,English,"Trailers,Commentaries,Deleted Scenes,Behind the Scenes",Action
BAREFOOT MANCHURIAN,2006,English,"Trailers,Commentaries",Action
BERETS AGENT,2006,English,Deleted Scenes,Action
BRIDE INTRIGUE,2006,English,"Trailers,Commentaries,Behind the Scenes",Action
BULL SHAWSHANK,2006,English,Deleted Scenes,Action
CADDYSHACK JEDI,2006,English,"Commentaries,Deleted Scenes",Action
CAMPUS REMEMBER,2006,English,Behind the Scenes,Action

<br>
Un ejemplo de procedimiento almacenado con parámetros, donde el parámetro definirá la cantidad de registros que se verán:

In [31]:
DELIMITER $$
CREATE PROCEDURE get_films_by_quantity(cantidad int)
BEGIN
    SELECT f.title, f.release_year, l.name as `language`, f.special_features, c.name as category
    FROM sakila.film f 
    JOIN sakila.film_category fc using(film_id)
    JOIN sakila.category c  using(category_id)
    JOIN sakila.`language` l using(language_id) 
    LIMIT cantidad;
END;

In [33]:
call get_films_by_quantity(5);

title,release_year,language,special_features,category
AMADEUS HOLY,2006,English,"Commentaries,Deleted Scenes,Behind the Scenes",Action
AMERICAN CIRCUS,2006,English,"Commentaries,Behind the Scenes",Action
ANTITRUST TOMATOES,2006,English,"Trailers,Commentaries,Deleted Scenes",Action
ARK RIDGEMONT,2006,English,"Trailers,Commentaries,Deleted Scenes,Behind the Scenes",Action
BAREFOOT MANCHURIAN,2006,English,"Trailers,Commentaries",Action

# Funciones

Una función es muy parecida a un procedimiento almacenado pero a diferencia de este, la función retorna un valor y se ejecuta de manera diferente. La sintaxis para crear una función es:

```sql
CREATE FUNCTION nombre_funcion()
BEGIN
--  código_sql
    RETURN value;
END;
```

Un ejemplo aplicado sería una función para calcular el factorial de un número:

In [34]:
DELIMITER //
CREATE FUNCTION factorial(x INT) RETURNS INT(11)
BEGIN
    DECLARE factorial INT;
    SET factorial = x ;
    
    IF x <= 0 THEN
        RETURN 1;
    END IF;
    
    bucle: LOOP
        SET x = x - 1 ;
        IF x<1 THEN
            LEAVE bucle;
        END IF;

        SET factorial = factorial * x ;
    END LOOP bucle;
    
    RETURN factorial;
END//
DELIMITER ;

Para ejecutar la función:

In [42]:
select factorial(5);

factorial(5)
120

# Triggers

Los Triggers o disparadores es un procedimiento almacenado pero que cuenta con la característica adicional, de poder definir su ejecución en el momento que ocurra un evento definido. Dichos eventos se generan para una operación INSERT, UPDATE o DELETE, por ejemplo se podría definir que para un INSERT con ciertas características (cierta base de datos sobre cierta tabla), se ejecute un procedimiento que se haya definido.

La sintaxis de un trigger es:

```sql
CREATE TRIGGER nombre_trigger {BEFORE|AFTER} {UPDATE|INSERT|DELETE} ON nombre_de_la_tabla
FOR EACH ROW
BEGIN
--  código_sql
    RETURN value;
END;
```
Cuando el evento es un UPDATE, se puede usar los identificadores OLD y NEW que se refieren al valor anterior (OLD) y el valor nuevo (NEW): por ejemplo OLD.idName o NEW.idName. Cuando el evento es un INSERT solo
se dispondra de NEW ya que no existe un valor previo que se pueda asociar a OLD. Cuando el evento es un DELETE solo se dispone ed OLD debido a que no exisite un valor nuevo (NEW) en esa operación.

Las opciones {BEFORE|AFTER} hacen referencia a el si el evento asociado es antes o después de la operación; por ejemplo, un Trigger BEFORE para un evento UPDATE define que el código del Trigger se ejecutará antes de realizar la operación.

Un ejemplo aplicado en la base de datos Employee, sería cuando un empleado ascienda (operación UPDATE en tabla employees) se actualice tambien la fecha de contratación:

In [48]:
DELIMITER $$
CREATE TRIGGER employees.ascenso_trigger
AFTER UPDATE ON employees.titles FOR EACH ROW
	UPDATE employees.employees SET hire_date = CURDATE() WHERE emp_no = NEW.emp_no;

Para utilizarlo se va utilizar el registro con `emp_no` 10008:

In [51]:
SELECT * FROM employees.employees e JOIN employees.titles t USING (emp_no)
WHERE e.emp_no = 10008;

emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
10008,1958-02-19,Saniya,Kalloufi,M,1994-09-15,Assistant Engineer,1998-03-11,2000-07-31

Ahora se va realizar un UPDATE a este registro:

In [52]:
UPDATE employees.titles SET title = 'Senior Engineer' WHERE emp_no = 10008;

Entonces para validar que el Trigger haya funcionado, se debió cambiar la fecha de contratación (hire_date) automáticamente:

In [53]:
SELECT * FROM employees.employees e JOIN employees.titles t USING (emp_no)
WHERE e.emp_no = 10008;

emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
10008,1958-02-19,Saniya,Kalloufi,M,2021-04-11,Senior Engineer,1998-03-11,2000-07-31

# Consultas de ejemplo

## Base de datos Employee:

In [1]:
SELECT * FROM employees.employees e 
JOIN employees.salaries s USING(emp_no)
JOIN employees.titles t USING(emp_no) LIMIT 10;

emp_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date,to_date,title,from_date,to_date
10001,1953-09-02,Georgi,Facello,M,1986-06-26,60117,1986-06-26,1987-06-26,Senior Engineer,1986-06-26,9999-01-01
10001,1953-09-02,Georgi,Facello,M,1986-06-26,62102,1987-06-26,1988-06-25,Senior Engineer,1986-06-26,9999-01-01
10001,1953-09-02,Georgi,Facello,M,1986-06-26,66074,1988-06-25,1989-06-25,Senior Engineer,1986-06-26,9999-01-01
10001,1953-09-02,Georgi,Facello,M,1986-06-26,66596,1989-06-25,1990-06-25,Senior Engineer,1986-06-26,9999-01-01
10001,1953-09-02,Georgi,Facello,M,1986-06-26,66961,1990-06-25,1991-06-25,Senior Engineer,1986-06-26,9999-01-01
10001,1953-09-02,Georgi,Facello,M,1986-06-26,71046,1991-06-25,1992-06-24,Senior Engineer,1986-06-26,9999-01-01
10001,1953-09-02,Georgi,Facello,M,1986-06-26,74333,1992-06-24,1993-06-24,Senior Engineer,1986-06-26,9999-01-01
10001,1953-09-02,Georgi,Facello,M,1986-06-26,75286,1993-06-24,1994-06-24,Senior Engineer,1986-06-26,9999-01-01
10001,1953-09-02,Georgi,Facello,M,1986-06-26,75994,1994-06-24,1995-06-24,Senior Engineer,1986-06-26,9999-01-01
10001,1953-09-02,Georgi,Facello,M,1986-06-26,76884,1995-06-24,1996-06-23,Senior Engineer,1986-06-26,9999-01-01

In [1]:
SELECT * FROM employees.employees e 
JOIN employees.dept_emp de USING(emp_no)
JOIN employees.departments d USING(dept_no) LIMIT 10;

dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,from_date,to_date,dept_name
d009,10011,1953-11-07,Mary,Sluis,F,1990-01-22,1990-01-22,1996-11-09,Customer Service
d009,10038,1960-07-20,Huan,Lortz,M,1989-09-20,1989-09-20,9999-01-01,Customer Service
d009,10049,1961-04-24,Basil,Tramer,F,1992-05-04,1992-05-04,9999-01-01,Customer Service
d009,10060,1961-10-15,Breannda,Billingsley,M,1987-11-02,1992-11-11,9999-01-01,Customer Service
d009,10088,1954-02-25,Jungsoon,Syrzycki,F,1988-09-02,1992-03-21,9999-01-01,Customer Service
d009,10098,1961-09-23,Sreekrishna,Servieres,F,1985-05-13,1989-06-29,1992-12-11,Customer Service
d009,10112,1963-08-13,Yuichiro,Swick,F,1985-10-08,1998-05-01,9999-01-01,Customer Service
d009,10115,1964-12-25,Chikara,Rissland,M,1986-01-23,1988-03-03,1992-05-24,Customer Service
d009,10126,1954-08-07,Kayoko,Valtorta,M,1985-09-08,1985-09-08,9999-01-01,Customer Service
d009,10128,1958-02-15,Babette,Lamba,F,1988-06-06,1988-06-06,9999-01-01,Customer Service

## Base de datos World:

In [3]:
SELECT * FROM world.city c 
JOIN world.country c2 ON c2.Code = c.CountryCode 
JOIN world.countrylanguage c3 ON c3.CountryCode = c2.Code LIMIT 10;

ID,Name,CountryCode,District,Population,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2,CountryCode,Language,IsOfficial,Percentage
129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.00,NULL,103000,78.4,828.00,793.00,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,Dutch,T,5.3
129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.00,NULL,103000,78.4,828.00,793.00,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,English,F,9.5
129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.00,NULL,103000,78.4,828.00,793.00,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,Papiamento,F,76.7
129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.00,NULL,103000,78.4,828.00,793.00,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,Spanish,F,7.4
1,Kabul,AFG,Kabol,1780000,AFG,Afghanistan,Asia,Southern and Central Asia,652090.00,1919,22720000,45.9,5976.00,NULL,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF,AFG,Balochi,F,0.9
1,Kabul,AFG,Kabol,1780000,AFG,Afghanistan,Asia,Southern and Central Asia,652090.00,1919,22720000,45.9,5976.00,NULL,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF,AFG,Dari,T,32.1
1,Kabul,AFG,Kabol,1780000,AFG,Afghanistan,Asia,Southern and Central Asia,652090.00,1919,22720000,45.9,5976.00,NULL,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF,AFG,Pashto,T,52.4
1,Kabul,AFG,Kabol,1780000,AFG,Afghanistan,Asia,Southern and Central Asia,652090.00,1919,22720000,45.9,5976.00,NULL,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF,AFG,Turkmenian,F,1.9
1,Kabul,AFG,Kabol,1780000,AFG,Afghanistan,Asia,Southern and Central Asia,652090.00,1919,22720000,45.9,5976.00,NULL,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF,AFG,Uzbek,F,8.8
2,Qandahar,AFG,Qandahar,237500,AFG,Afghanistan,Asia,Southern and Central Asia,652090.00,1919,22720000,45.9,5976.00,NULL,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF,AFG,Balochi,F,0.9

## Base de datos World-X

In [4]:
SELECT * FROM world_x.city c 
JOIN world_x.country c2 ON c2.Code = c.CountryCode 
JOIN world_x.countrylanguage c3 ON c3.CountryCode = c2.Code LIMIT 10;

ID,Name,CountryCode,District,Info,Code,Name,Capital,Code2,CountryCode,Language,IsOfficial,Percentage
1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Balochi,F,0.9
1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Dari,T,32.1
1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Pashto,T,52.4
1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Turkmenian,F,1.9
1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Uzbek,F,8.8
2,Qandahar,AFG,Qandahar,"{""Population"": 237500}",AFG,Afghanistan,1,AF,AFG,Balochi,F,0.9
2,Qandahar,AFG,Qandahar,"{""Population"": 237500}",AFG,Afghanistan,1,AF,AFG,Dari,T,32.1
2,Qandahar,AFG,Qandahar,"{""Population"": 237500}",AFG,Afghanistan,1,AF,AFG,Pashto,T,52.4
2,Qandahar,AFG,Qandahar,"{""Population"": 237500}",AFG,Afghanistan,1,AF,AFG,Turkmenian,F,1.9
2,Qandahar,AFG,Qandahar,"{""Population"": 237500}",AFG,Afghanistan,1,AF,AFG,Uzbek,F,8.8

## Base de datos Sakila:

In [7]:
SELECT CONCAT(s.first_name, _utf8' ',  s.last_name) AS Actor 
FROM sakila.actor as s
order by s.last_name LIMIT 10;

Actor
DEBBIE AKROYD
KIRSTEN AKROYD
CHRISTIAN AKROYD
MERYL ALLEN
CUBA ALLEN
KIM ALLEN
ANGELINA ASTAIRE
RUSSELL BACALL
AUDREY BAILEY
JESSICA BAILEY

In [9]:
SELECT c.name as categoria, COUNT(actor_id) AS numero_actores
FROM sakila.category AS c
JOIN sakila.film_category as fc ON c.category_id = fc.category_id
JOIN sakila.film as f ON fc.film_id = f.film_id
JOIN sakila.film_actor as fa ON f.film_id = fa.film_id
GROUP BY categoria
ORDER BY numero_actores DESC LIMIT 10;

categoria,numero_actores
Sports,441
Foreign,397
Documentary,385
Action,363
Animation,361
Drama,350
Family,347
Children,344
New,343
Sci-Fi,326

In [10]:
SELECT  d.address as tienda,
        CONCAT(a.first_name, _utf8' ',  a.last_name) AS actor_estrella,
        MAX(p.amount) as valor
FROM sakila.actor AS a
JOIN sakila.film_actor AS fa ON a.actor_id = fa.actor_id
JOIN sakila.film AS f ON fa.film_id = f.film_id
JOIN sakila.inventory AS i ON f.film_id = i.film_id
JOIN sakila.rental AS r ON i.inventory_id = r.inventory_id
JOIN sakila.payment AS p ON r.rental_id = p.rental_id
JOIN sakila.store AS s ON i.store_id = s.store_id
JOIN sakila.address AS d ON s.address_id = d.address_id
GROUP BY tienda;

tienda,actor_estrella,valor
28 MySQL Boulevard,PENELOPE GUINESS,11.99
47 MySakila Drive,PENELOPE GUINESS,11.99

## Base de datos Menagerie:

In [1]:
SELECT * FROM menagerie.pet;

name,owner,species,sex,birth,death
Puffball,Diane,hamster,f,1999-03-30,NULL
Fluffy,Harold,cat,f,1993-02-04,NULL
Claws,Gwen,cat,m,1994-03-17,NULL
Buffy,Harold,dog,f,1989-05-13,NULL
Fang,Benny,dog,m,1990-08-27,NULL
Bowser,Diane,dog,m,1979-08-31,1995-07-29
Chirpy,Gwen,bird,f,1998-09-11,NULL
Whistler,Gwen,bird,NULL,1997-12-09,NULL
Slim,Benny,snake,m,1996-04-29,NULL

In [14]:
SELECT * FROM menagerie.event;

name,date,type,remark
Fluffy,1995-05-15,litter,"4 kittens, 3 female, 1 male"
Buffy,1993-06-23,litter,"5 puppies, 2 female, 3 male"
Buffy,1994-06-19,litter,"3 puppies, 3 female"
Chirpy,1999-03-21,vet,needed beak straightened
Slim,1997-08-03,vet,broken rib
Bowser,1991-10-12,kennel,NULL
Fang,1991-10-12,kennel,NULL
Fang,1998-08-28,birthday,Gave him a new chew toy
Claws,1998-03-17,birthday,Gave him a new flea collar
Whistler,1998-12-09,birthday,First birthday

# Python y estadísticas básicas.

In [1]:
import pymysql
import pandas
import matplotlib.pyplot as plt
from sqlalchemy import create_engine

## Base de datos Employee:

In [7]:
engine = create_engine("mariadb+pymysql://drojas:dcrojas.3124@localhost:3306/sakila?charset=utf8mb4")

In [8]:
df = pandas.read_sql("SELECT * FROM employees.employees;", engine)

In [9]:
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [10]:
df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [11]:
df = pandas.read_sql("SELECT * FROM employees.salaries;", engine)

In [12]:
df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25

In [13]:
df.describe()

             emp_no        salary
count  2.844047e+06  2.844047e+06
mean   2.530574e+05  6.381074e+04
std    1.618447e+05  1.690483e+04
min    1.000100e+04  3.862300e+04
25%    8.487800e+04  5.050700e+04
50%    2.497800e+05  6.114300e+04
75%    4.249170e+05  7.419200e+04
max    4.999990e+05  1.582200e+05

In [14]:
df = pandas.read_sql("SELECT * FROM employees.titles;", engine)

In [15]:
df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [16]:
df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

## Base de datos World:

In [17]:
engine = create_engine("mariadb+pymysql://drojas:dcrojas.3124@localhost:3306/world?charset=utf8mb4")

In [18]:
df = pandas.read_sql("SELECT * FROM world.city c \
JOIN world.country c2 ON c2.Code = c.CountryCode \
JOIN world.countrylanguage c3 ON c3.CountryCode = c2.Code LIMIT 10;", engine)

In [19]:
df.head()

,ID,Name,CountryCode,District,Population,Code,Name,Continent,Region,SurfaceArea,...,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2,CountryCode,Language,IsOfficial,Percentage
0,129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.0,...,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,Dutch,T,5.3
1,129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.0,...,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,English,F,9.5
2,129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.0,...,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,Papiamento,F,76.7
3,129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.0,...,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,Spanish,F,7.4
4,1,Kabul,AFG,Kabol,1780000,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,...,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF,AFG,Balochi,F,0.9

In [20]:
df.describe()

,ID,Population,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,Capital,Percentage
count,10.000000,1.000000e+01,10.000000,6.0,1.000000e+01,10.000000,10.000000,4.0,10.000000,10.000000
mean,52.300000,9.253636e+05,391331.200000,1919.0,1.367320e+07,58.900000,3916.800000,793.0,52.200000,19.590000
std,66.013551,9.030073e+05,336638.163259,0.0,1.167937e+07,16.782928,2658.415769,0.0,66.098916,25.985357
min,1.000000,2.903400e+04,193.000000,1919.0,1.030000e+05,45.900000,828.000000,793.0,1.000000,0.900000
25%,1.000000,2.903400e+04,193.000000,1919.0,1.030000e+05,45.900000,828.000000,793.0,1.000000,2.750000
50%,1.500000,1.008750e+06,652090.000000,1919.0,2.272000e+07,45.900000,5976.000000,793.0,1.000000,8.100000
75%,129.000000,1.780000e+06,652090.000000,1919.0,2.272000e+07,78.400000,5976.000000,793.0,129.000000,26.450000
max,129.000000,1.780000e+06,652090.000000,1919.0,2.272000e+07,78.400000,5976.000000,793.0,129.000000,76.700000

In [21]:
df = pandas.read_sql("SELECT * FROM world.city c \
JOIN world.country c2 ON c2.Code = c.CountryCode \
JOIN world.countrylanguage c3 ON c3.CountryCode = c2.Code LIMIT 10;", engine)

In [22]:
df.head()

,ID,Name,CountryCode,District,Population,Code,Name,Continent,Region,SurfaceArea,...,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2,CountryCode,Language,IsOfficial,Percentage
0,129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.0,...,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,Dutch,T,5.3
1,129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.0,...,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,English,F,9.5
2,129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.0,...,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,Papiamento,F,76.7
3,129,Oranjestad,ABW,–,29034,ABW,Aruba,North America,Caribbean,193.0,...,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW,ABW,Spanish,F,7.4
4,1,Kabul,AFG,Kabol,1780000,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,...,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF,AFG,Balochi,F,0.9

In [23]:
df.describe()

,ID,Population,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,Capital,Percentage
count,10.000000,1.000000e+01,10.000000,6.0,1.000000e+01,10.000000,10.000000,4.0,10.000000,10.000000
mean,52.300000,9.253636e+05,391331.200000,1919.0,1.367320e+07,58.900000,3916.800000,793.0,52.200000,19.590000
std,66.013551,9.030073e+05,336638.163259,0.0,1.167937e+07,16.782928,2658.415769,0.0,66.098916,25.985357
min,1.000000,2.903400e+04,193.000000,1919.0,1.030000e+05,45.900000,828.000000,793.0,1.000000,0.900000
25%,1.000000,2.903400e+04,193.000000,1919.0,1.030000e+05,45.900000,828.000000,793.0,1.000000,2.750000
50%,1.500000,1.008750e+06,652090.000000,1919.0,2.272000e+07,45.900000,5976.000000,793.0,1.000000,8.100000
75%,129.000000,1.780000e+06,652090.000000,1919.0,2.272000e+07,78.400000,5976.000000,793.0,129.000000,26.450000
max,129.000000,1.780000e+06,652090.000000,1919.0,2.272000e+07,78.400000,5976.000000,793.0,129.000000,76.700000

## Base de datos World-X:

In [25]:
engine = create_engine("mariadb+pymysql://drojas:dcrojas.3124@localhost:3306/world_x?charset=utf8mb4")

In [26]:
df = pandas.read_sql("SELECT * FROM world_x.city c \
JOIN world_x.country c2 ON c2.Code = c.CountryCode \
JOIN world_x.countrylanguage c3 ON c3.CountryCode = c2.Code LIMIT 10;", engine)

In [27]:
df.head()

,ID,Name,CountryCode,District,Info,Code,Name,Capital,Code2,CountryCode,Language,IsOfficial,Percentage
0,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Balochi,F,0.9
1,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Dari,T,32.1
2,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Pashto,T,52.4
3,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Turkmenian,F,1.9
4,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Uzbek,F,8.8

In [28]:
df.describe()

              ID  Capital  Percentage
count  10.000000     10.0   10.000000
mean    1.500000      1.0   19.220000
std     0.527046      0.0   21.139684
min     1.000000      1.0    0.900000
25%     1.000000      1.0    1.900000
50%     1.500000      1.0    8.800000
75%     2.000000      1.0   32.100000
max     2.000000      1.0   52.400000

In [29]:
df = pandas.read_sql("SELECT * FROM world_x.city c \
JOIN world_x.country c2 ON c2.Code = c.CountryCode \
JOIN world_x.countrylanguage c3 ON c3.CountryCode = c2.Code LIMIT 10;", engine)

In [30]:
df.head()

,ID,Name,CountryCode,District,Info,Code,Name,Capital,Code2,CountryCode,Language,IsOfficial,Percentage
0,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Balochi,F,0.9
1,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Dari,T,32.1
2,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Pashto,T,52.4
3,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Turkmenian,F,1.9
4,1,Kabul,AFG,Kabol,"{""Population"": 1780000}",AFG,Afghanistan,1,AF,AFG,Uzbek,F,8.8

In [31]:
df.describe()

              ID  Capital  Percentage
count  10.000000     10.0   10.000000
mean    1.500000      1.0   19.220000
std     0.527046      0.0   21.139684
min     1.000000      1.0    0.900000
25%     1.000000      1.0    1.900000
50%     1.500000      1.0    8.800000
75%     2.000000      1.0   32.100000
max     2.000000      1.0   52.400000

## Base de datos Sakila:

In [38]:
engine = create_engine("mariadb+pymysql://drojas:dcrojas.3124@localhost:3306/sakila?charset=utf8mb4")

In [39]:
df = pandas.read_sql("SELECT CONCAT(s.first_name, _utf8' ',  s.last_name) AS Actor \
FROM sakila.actor as s \
order by s.last_name ;", engine)

In [40]:
df.head()

              Actor
0     DEBBIE AKROYD
1    KIRSTEN AKROYD
2  CHRISTIAN AKROYD
3       MERYL ALLEN
4        CUBA ALLEN

In [41]:
df.describe()

              Actor
count           200
unique          199
top     SUSAN DAVIS
freq              2

In [35]:
df = pandas.read_sql("SELECT c.name as categoria, COUNT(actor_id) AS numero_actores \
FROM sakila.category AS c \
JOIN sakila.film_category as fc ON c.category_id = fc.category_id \
JOIN sakila.film as f ON fc.film_id = f.film_id \
JOIN sakila.film_actor as fa ON f.film_id = fa.film_id \
GROUP BY categoria \
ORDER BY numero_actores DESC;", engine)

In [36]:
df.head()

     categoria  numero_actores
0       Sports             441
1      Foreign             397
2  Documentary             385
3       Action             363
4    Animation             361

In [37]:
df.describe()

       numero_actores
count       16.000000
mean       341.375000
std         42.715922
min        281.000000
25%        314.500000
50%        343.500000
75%        361.500000
max        441.000000

In [42]:
df = pandas.read_sql("SELECT  d.address as tienda, \
        CONCAT(a.first_name, _utf8' ',  a.last_name) AS actor_estrella, \
        MAX(p.amount) as valor \
FROM sakila.actor AS a \
JOIN sakila.film_actor AS fa ON a.actor_id = fa.actor_id \
JOIN sakila.film AS f ON fa.film_id = f.film_id \
JOIN sakila.inventory AS i ON f.film_id = i.film_id \
JOIN sakila.rental AS r ON i.inventory_id = r.inventory_id \
JOIN sakila.payment AS p ON r.rental_id = p.rental_id \
JOIN sakila.store AS s ON i.store_id = s.store_id \
JOIN sakila.address AS d ON s.address_id = d.address_id \
GROUP BY tienda;", engine)

In [43]:
df.head()

               tienda    actor_estrella  valor
0  28 MySQL Boulevard  PENELOPE GUINESS  11.99
1   47 MySakila Drive  PENELOPE GUINESS  11.99

In [44]:
df.describe()

       valor
count   2.00
mean   11.99
std     0.00
min    11.99
25%    11.99
50%    11.99
75%    11.99
max    11.99

## Base de datos Menagerie:

In [38]:
engine = create_engine("mariadb+pymysql://drojas:dcrojas.3124@localhost:3306/menagerie?charset=utf8mb4")

In [48]:
df = pandas.read_sql("SELECT * FROM menagerie.pet;", engine)

In [49]:
df.head()

       name   owner  species sex       birth death
0  Puffball   Diane  hamster   f  1999-03-30  None
1    Fluffy  Harold      cat   f  1993-02-04  None
2     Claws    Gwen      cat   m  1994-03-17  None
3     Buffy  Harold      dog   f  1989-05-13  None
4      Fang   Benny      dog   m  1990-08-27  None

In [50]:
df.describe()

        name owner species sex       birth       death
count      9     9       9   8           9           1
unique     9     4       5   2           9           1
top     Slim  Gwen     dog   m  1996-04-29  1995-07-29
freq       1     3       3   4           1           1

In [51]:
df = pandas.read_sql("SELECT * FROM menagerie.event;", engine)

In [52]:
df.head()

     name        date    type                       remark
0  Fluffy  1995-05-15  litter  4 kittens, 3 female, 1 male
1   Buffy  1993-06-23  litter  5 puppies, 2 female, 3 male
2   Buffy  1994-06-19  litter          3 puppies, 3 female
3  Chirpy  1999-03-21     vet     needed beak straightened
4    Slim  1997-08-03     vet                   broken rib

In [53]:
df.describe()

        name        date      type                   remark
count     10          10        10                        8
unique     8           9         4                        8
top     Fang  1991-10-12  birthday  Gave him a new chew toy
freq       2           2         3                        1

# Bibliografía

- [1] Oracle corporation (2021) MySQL Reference Manual (Version 8.0) [Software documentation], disponible en [MySQL documentation](https://dev.mysql.com/doc/index-other.html)
- [2] Patrick Crews, Giuseppe Maxia (2016) Código fuente de base de datos "Employee" [Código fuente], disponible en [MySQL documentation](https://dev.mysql.com/doc/employee/en/)
- [3] Oracle corporation (n.d.) Código fuente de base de datos "World" [Código fuente], disponible en [MySQL documentation](https://dev.mysql.com/doc/world-setup/en/)
- [4] Oracle corporation (2016) Código fuente de base de datos "World-X" [Código fuente], disponible en [MySQL documentation](https://dev.mysql.com/doc/world-x-setup/en/)
- [5] Mike Hillyer, Oracle corporation (2005) Código fuente de base de datos "Sakila" [Código fuente], disponible en [MySQL documentation](https://dev.mysql.com/doc/sakila/en/)
- [6] Oracle corporation (n.d.) Código fuente de base de datos "Menagerie" [Código fuente], disponible en [MySQL documentation](https://dev.mysql.com/doc/refman/8.0/en/database-use.html)